{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey",
        "Hello, Hi can I help you today?",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, you're always welcome for any other queries!",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "benefits",
      "patterns": [
        "What benefits does the company offer?",
        "What are the benefits I can get as an employee?",
        "List down the benefits that the company offers"
      ],
      "responses": [
        "We offer a range of benefits including health insurance, retirement plans, and flexible spending accounts.",
        "You can find the benefits you are eligible for through our HR portal. These mainly include health insurance, retirement plans, and flexible spending accounts."
      ]
    },
    {
      "tag": "information",
      "patterns": [
        "How can I update my personal information?",
        "What is the procedure to update my personal information?",
        "How does one update their personal information?"
      ],
      "responses": [
        "You can update your personal information by logging into our HR portal and selecting the \"Personal Information\" tab.",
        "Simply log in to our HR portal and navigate to the \"Personal Information\" section."
      ]
    },
    {
      "tag": "vacation",
      "patterns": [
        "What is the vacation policy?",
        "How many days off I can take?",
        "How many vacation days do employees get per year?"
      ],
      "responses": [
        "Employees can take 25 days off per year excluding holidays.",
        "Excluding holidays, you are allowed to take 25 days off per year.",
        "You can take 2 days off per month apart from company holidays."
      ]
    },
    {
      "tag": "remote work",
      "patterns": [
        "What is the company's policy on remote work?",
        "Can I work remotely some days of the week? ",
        "Am I allowed to work remotely?"
      ],
      "responses": [
        "Our policy on remote work allows employees to work from home up to two days per week with manager approval",
        "Our company has a flexible work policy that allows employees to work remotely when necessary. Employees must obtain approval from their supervisor before working remotely."
      ]
    },
    {
      "tag": "dress code",
      "patterns": [
        "What is the company's policy on dress code?",
        "What is the dress code for the company?",
        "What type of clothing should I wear to work?"
      ],
      "responses": [
        "Our dress code policy is business casual. Employees are expected to dress professionally and in a manner that is appropriate for their job function.",
        "Our dress code policy requires employees to dress professionally and adhere to business casual attire unless otherwise specified."
      ]
    },
     {
      "tag": "workplace issues",
      "patterns": [
        "How do I report a workplace issue or complaint?",
        "What is the procedure to report a workplace issue?",
        "How can I report a complaint regarding a workplace issue?"
      ],
      "responses": [
        "You can report a workplace issue or complaint by speaking to your manager, HR representative, or by submitting a report through our HR portal.",
        "Our policy on workplace bullying prohibits any form of verbal, physical, or psychological harassment. If you experience workplace bullying, please report it to HR.",
        "If you experience harassment or discrimination in the workplace, you should report it to HR immediately. We take these matters very seriously and will investigate and take appropriate action."
      ]
    },
    {
      "tag": "performance review",
      "patterns": [
        "Can you explain the company's performance review process?",
        "What is the company's performance review process?",
        "Can I know about the company's performance review procedure?"
      ],
      "responses": [
        "Our performance review process involves a series of meetings with your manager to discuss your goals, progress, and any areas for improvement.",
        "Performance is measured based on a combination of factors, such as job duties, quality of work, productivity, and contributions to the team or organization. Your manager will provide you with specific performance metrics that are relevant to your role.",
        "Your performance is evaluated based on specific goals and objectives that were set at the beginning of the review period. We also consider factors such as your contributions to the team, your ability to work independently, and your adherence to company policies and procedures."
      ]
    },
     {
      "tag": "maternity leave",
      "patterns": [
        "What is the company's policy on maternity leave?",
        "What is the company's policy on paternity leave?",
        "I wanted to know about the procedure for taking a maternity leave."
      ],
      "responses": [
        "Our policy on maternity/paternity leave allows eligible employees to take up to 12 weeks of unpaid leave following the birth or adoption of a child.",
        "You are eligible for up to 12 weeks of unpaid paternity leave following the birth or adoption of a child. However, the specific amount of leave may vary depending on your location and the laws in your country or state."
      ]
    },
     {
      "tag": "overtime pay",
      "patterns": [
        "How does the company measure overtime pay?",
        "What is the company's policy on overtime pay?",
        "On what basis the overtime pay is calculated?"
      ],
      "responses": [
        "Overtime pay is typically calculated as time-and-a-half or double-time, depending on the laws in your country or state. This means that for every hour worked beyond the threshold, you will receive 1.5 or 2 times your regular hourly rate.",
        "Overtime pay is typically calculated as 1.5 times your regular hourly rate for every hour worked over 40 hours in a workweek. However, the specific calculation may vary depending on your location and the laws in your country or state.",
        "Overtime pay is calculated based on your regular hourly rate, multiplied by one and a half times the number of hours worked over the standard 40 hours per week. For example, if your hourly rate is 100 Rs and you work 50 hours in a week, you would receive 10 hours of overtime pay at 101.5 Rs per hour."
      ]
    },
    {
      "tag": "training",
      "patterns": [
        "What types of training are available to employees?",
        "Can I request additional training to improve my skills?",
        "How do I sign up for a training course?"
      ],
      "responses": [
        "We offer a variety of training opportunities, including on-the-job training, classroom training, online courses, and workshops. These training programs are designed to help employees develop new skills, improve existing skills, and advance their careers.",
        "You can request additional training to improve your skills. We encourage employees to discuss their training needs and career goals with their manager and to explore the available training options. However, please note that some training programs may require approval from your manager or HR.",
        "You can sign up for training programs through our online learning management system or by contacting HR. We encourage employees to take advantage of the available training programs and to discuss their career goals and development needs with their manager."
      ]
    }
  ]
}